/*
#7
Сформировать запрос для получения числа в группе No 3100 отличников.
*/
WITH УЧЕНИКИ_3100 AS (
  SELECT 
    Н_УЧЕНИКИ.ИД, 
    Н_УЧЕНИКИ.ЧЛВК_ИД 
  FROM 
    Н_УЧЕНИКИ 
  WHERE 
    Н_УЧЕНИКИ.ГРУППА = '3100'
) 
SELECT 
  count(*) 
FROM 
  (
    SELECT 
      УЧЕНИКИ_3100.ИД 
    FROM 
      УЧЕНИКИ_3100 
      INNER JOIN Н_ВЕДОМОСТИ USING (ЧЛВК_ИД) 
    WHERE 
      Н_ВЕДОМОСТИ.ОЦЕНКА = '5' 
    GROUP BY 
      УЧЕНИКИ_3100.ИД
  ) AS ТРОЕЧНИКИ 
WHERE 
  ТРОЕЧНИКИ.ИД NOT IN (
    SELECT 
      УЧЕНИКИ_3100.ИД 
    FROM 
      УЧЕНИКИ_3100 
      INNER JOIN Н_ВЕДОМОСТИ USING (ЧЛВК_ИД) 
    WHERE 
      Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', 'незач') 
    GROUP BY 
      УЧЕНИКИ_3100.ИД
  );
